app/Controllers/Admin/Appointments.php

    public function index()
    {
        $model = new AppointmentModel();
        $data['appointments'] = $model->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM `appointments`
ORDER BY `created_at` DESC