app/Controllers/Admin/Dashboard.php

    public function index()
    {
        $appointmentModel = new AppointmentModel();
        $documentModel = new DocumentModel();

        $data = [
            'totalAppointments' => $appointmentModel->countAll(),
            'approvedAppointments' => $appointmentModel->where('status', 'approved')->countAllResults(),
            'declinedAppointments' => $appointmentModel->where('status', 'declined')->countAllResults(),
            'pendingAppointments' => $appointmentModel->where('status', 'pending')->countAllResults(),

            'totalDocuments' => $documentModel->countAll(),
            'verifiedDocuments' => $documentModel->where('status', 'verified')->countAllResults(),
            'rejectedDocuments' => $documentModel->where('status', 'rejected')->countAllResults()
---
SELECT COUNT(*) AS `numrows`
FROM `appointments`
WHERE `status` = 'approved'
SELECT COUNT(*) AS `numrows`
FROM `appointments`
WHERE `status` = 'declined'
SELECT COUNT(*) AS `numrows`
FROM `appointments`
WHERE `status` = 'pending'
SELECT COUNT(*) AS `numrows` FROM `documents`
SELECT COUNT(*) AS `numrows`
FROM `documents`
WHERE `status` = 'verified'
SELECT COUNT(*) AS `numrows`
FROM `documents`
WHERE `status` = 'rejected'