app/Controllers/Admin/Documents.php

SELECT *
FROM `documents`
ORDER BY `created_at` DESC
---
    public function index()
    {
        $model = new DocumentModel();
        $data['documents'] = $model->orderBy('created_at', 'DESC')->findAll();