app/Controllers/Admin/ParcelController.php

SELECT *
FROM `parcels`
---
    public function fetch()
    {
        $model = new ParcelModel();
        $parcels = $model->findAll();